Classes | Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::RoutingElementDefault Class Reference
MEP Element Manager
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element. More...
#include <MEPRoutingElementDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingElementDefault:
 Classes
class  | Modifier
Modifier of the RoutingElementDefault. More...
 Public Member Functions
RoutingSegmentDefault  | GetRoutingSegmentDefault () const
RoutingNodeDefault  | GetRoutingNodeDefault () const
Domain  | GetDomain () const
Retrieves the domain of the RoutingElementDefault.
API_AttributeIndex  | GetMEPSystem () const
Result< UniqueID >  | GetBranchPreferenceTableId () const
FloorPlanDisplayOption  | GetFloorPlanDisplayOption () const
CutPlanePosition  | GetCutPlanePosition () const
ShowProjection  | GetShowProjection () const
OnStoryVisibility  | GetOnStoryVisibility () const
Result< UniqueID >  | Place (const std::vector< API_Coord3D > &nodeCoordinates, const std::map< UInt32, RoutingSegmentRectangularCrossSectionData > &rectangularCrossSectionData, const std::map< UInt32, RoutingSegmentCircularCrossSectionData > &circularCrossSectionData, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a Routing element based on the Default.
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
RoutingElementDefault (std::shared_ptr< Impl::IRoutingElementDefaultImpl > impl)
Constructs a RoutingElementDefault with the given implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Static Protected Member Functions
static Result< RoutingElementDefault >  | Create (const API_Token &token, Domain domain)
Creates a RoutingElementDefault with the given token and domain.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< RoutingElementDefault >  | CreateRoutingElementDefault (Domain domain)
Creates a RoutingElementDefault.
MEPAPI_EXPORT Result< RoutingElementDefault >  | CreateRoutingElementDefault (const ACAPI::ElementDefault &defaultElem)
Creates a RoutingElementDefault from the given base element default.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element.
Since
Archicad 27
Example code snippet from Test / New MEP
Pickup and Getters
 // Write Defaults
 RoutingElementDefault routingElementDefault = routingElement->PickUpDefault ();
 // Default Routing Segment
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Routing Segment:");
 routingElementReporter.SetTabCount (1);
 RoutingSegmentDefault routingSegmentDefault = routingElementDefault.GetRoutingSegmentDefault ();
 ConnectorShape shape = routingSegmentDefault.GetCrossSectionShape ();
 routingElementReporter.Add ("Table of dimensions ID", routingSegmentDefault.GetPreferenceTableId ());
 if (shape == ConnectorShape::Circular)
 routingElementReporter.Add ("Reference ID", *routingSegmentDefault.GetCrossSectionReferenceId ());
 routingElementReporter.Add ("Cross Section Shape", shape);
 routingElementReporter.Add ("Cross Section Width", routingSegmentDefault.GetCrossSectionWidth ());
 routingElementReporter.Add ("Cross Section Height", routingSegmentDefault.GetCrossSectionHeight ());
 routingElementReporter.Add ("Wall thickness", routingSegmentDefault.GetWallThickness ());
 routingElementReporter.Add ("Anchor", routingSegmentDefault.GetAnchor ());
 routingElementReporter.Add ("Offset X", routingSegmentDefault.GetReferenceLineOffsetX ());
 routingElementReporter.Add ("Offset Y", routingSegmentDefault.GetReferenceLineOffsetY ());
 ConnectionStyle style = routingSegmentDefault.GetConnectionStyle ();
 routingElementReporter.Add ("Connection style", style);
 if (style == ConnectionStyle::Flanged)
 routingElementReporter.Add (shape == ConnectorShape::Circular ? "Flange diameter" : "Flange width", *routingSegmentDefault.GetFlangeSize ());
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Rigid Segment:");
 routingElementReporter.SetTabCount (2);
 // Default Routing Node
 routingElementReporter.SetTabCount (0);
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Routing Node:");
 routingElementReporter.SetTabCount (1);
 RoutingNodeDefault routingNodeDefault = routingElementDefault.GetRoutingNodeDefault ();
 routingElementReporter.Add ("Preferred Transition Placement", routingNodeDefault.GetPreferredTransitionPlacement ());
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Elbow:");
 routingElementReporter.SetTabCount (2);
 ElbowDefault elbowDefault = routingNodeDefault.GetElbowDefault ();
 if (elbowDefault.GetDomain () != Domain::Piping)
 routingElementReporter.Add ("Factor Radius", *elbowDefault.GetFactorRadius ());
 routingElementReporter.SetTabCount (1);
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Transition:");
 routingElementReporter.SetTabCount (2);
 TransitionDefault transitionDefault = routingNodeDefault.GetTransitionDefault ();
 if (transitionDefault.GetDomain () != Domain::Piping)
 routingElementReporter.Add ("Angle", *transitionDefault.GetAngle ());
 routingElementReporter.Add ("Offset Y", transitionDefault.GetOffsetY ());
 routingElementReporter.Add ("Offset Z", transitionDefault.GetOffsetZ ());
 routingElementReporter.Write ();
 Assemble placement data
 std::vector<API_Coord3D> referenceCoords1;
 referenceCoords1.push_back ({ 0.0, 0.0, 2.0 });
 referenceCoords1.push_back ({ 5.0, 0.0, 2.0 });
 referenceCoords1.push_back ({ 5.0, 5.0, 2.0 });
 referenceCoords1.push_back ({ 10.0, 5.0, 2.0 });
 referenceCoords1.push_back ({ 10.0, 10.0, 2.0 });
 std::map<UInt32, ACAPI::MEP::RoutingSegmentRectangularCrossSectionData> rectangularCrossSectionData1;
 std::map<UInt32, ACAPI::MEP::RoutingSegmentCircularCrossSectionData> circularCrossSectionData1;
 std::vector<API_Coord3D> referenceCoords2;
 referenceCoords2.push_back ({ 10.0, 10.0, 2.0 });
 referenceCoords2.push_back ({ 15.0, 10.0, 2.0 });
 referenceCoords2.push_back ({ 15.0, 15.0, 2.0 });
 std::map<UInt32, ACAPI::MEP::RoutingSegmentRectangularCrossSectionData> rectangularCrossSectionData2;
 std::map<UInt32, ACAPI::MEP::RoutingSegmentCircularCrossSectionData> circularCrossSectionData2;
 circularCrossSectionData2.emplace (0, ACAPI::MEP::RoutingSegmentCircularCrossSectionData (20));
 circularCrossSectionData2.emplace (1, ACAPI::MEP::RoutingSegmentCircularCrossSectionData (20));
 return PlaceRoutesAndConnect ({ { referenceCoords1, std::make_pair (rectangularCrossSectionData1, circularCrossSectionData1) }, { referenceCoords2, std::make_pair (rectangularCrossSectionData2, circularCrossSectionData2) } }, Domain::Piping);
 Placement
 std::vector<UniqueID> routeIds;
 routeIds.reserve (placementData.size ());
 ACAPI::Result<RoutingElementDefault> routingElementDefault = CreateRoutingElementDefault (domain);
 if (routingElementDefault.IsErr ())
 return { routingElementDefault.UnwrapErr (), ACAPI_GetToken () };
 for (const auto& [referenceCoords, crossSectionDataMaps] : placementData) {
 // Optionally, you could provide a GUID for the placed route with a third parameter
 ACAPI::Result<UniqueID> routingElemId = routingElementDefault->Place (referenceCoords, crossSectionDataMaps.first, crossSectionDataMaps.second);
 if (routingElemId.IsErr ())
 return { routingElemId.UnwrapErr (), ACAPI_GetToken () };
 routeIds.emplace_back (*routingElemId);
 }
 return ACAPI::Ok (std::move (routeIds));
Constructor & Destructor Documentation
◆ RoutingElementDefault()
 ACAPI::MEP::RoutingElementDefault::RoutingElementDefault  |  ( |  std::shared_ptr< Impl::IRoutingElementDefaultImpl > |  impl | )
protected
Constructs a RoutingElementDefault with the given implementation.
Parameters
impl | The given implementation.
Member Function Documentation
◆ Create()
 static Result< RoutingElementDefault > ACAPI::MEP::RoutingElementDefault::Create  |  ( |  const API_Token & |  token,
|  Domain |  domain )
staticprotected
Creates a RoutingElementDefault with the given token and domain.
Parameters
token | The given token.
domain | The given domain.
Returns
The result with the created RoutingElementDefault.
◆ GetBranchPreferenceTableId()
 Result< UniqueID > ACAPI::MEP::RoutingElementDefault::GetBranchPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the Branch PreferenceTable of a Duct or Pipe RoutingElementDefault, in case of Cable Carrier returns Error.
◆ GetCutPlanePosition()
 CutPlanePosition ACAPI::MEP::RoutingElementDefault::GetCutPlanePosition  |  ( |   | ) |   const
Returns
Returns the cut plane position of the RoutingElementDefault
◆ GetDomain()
 Domain ACAPI::MEP::RoutingElementDefault::GetDomain  |  ( |   | ) |   const
Retrieves the domain of the RoutingElementDefault.
Returns
The domain of the RoutingElementDefault.
◆ GetFloorPlanDisplayOption()
 FloorPlanDisplayOption ACAPI::MEP::RoutingElementDefault::GetFloorPlanDisplayOption  |  ( |   | ) |   const
Returns
Returns the floor plan display option of the RoutingElementDefault
◆ GetMEPSystem()
 API_AttributeIndex ACAPI::MEP::RoutingElementDefault::GetMEPSystem  |  ( |   | ) |   const
Returns
Returns the MEPSystem attribute of the RoutingElementDefault.
◆ GetOnStoryVisibility()
 OnStoryVisibility ACAPI::MEP::RoutingElementDefault::GetOnStoryVisibility  |  ( |   | ) |   const
Returns
Returns the show projection setting of the RoutingElementDefault
◆ GetRoutingNodeDefault()
 RoutingNodeDefault ACAPI::MEP::RoutingElementDefault::GetRoutingNodeDefault  |  ( |   | ) |   const
Returns
Returns the RoutingNodeDefault of the RoutingElementDefault.
◆ GetRoutingSegmentDefault()
 RoutingSegmentDefault ACAPI::MEP::RoutingElementDefault::GetRoutingSegmentDefault  |  ( |   | ) |   const
Returns
Returns the RoutingSegmentDefault of the RoutingElementDefault.
◆ GetShowProjection()
 ShowProjection ACAPI::MEP::RoutingElementDefault::GetShowProjection  |  ( |   | ) |   const
Returns
Returns the show projection setting of the RoutingElementDefault
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::RoutingElementDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ Place()
 Result< UniqueID > ACAPI::MEP::RoutingElementDefault::Place  |  ( |  const std::vector< API_Coord3D > & |  nodeCoordinates,
|  const std::map< UInt32, RoutingSegmentRectangularCrossSectionData > & |  rectangularCrossSectionData,
|  const std::map< UInt32, RoutingSegmentCircularCrossSectionData > & |  circularCrossSectionData,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places a Routing element based on the Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
nodeCoordinates | List of coordinates for the corner points of RoutingElement.
rectangularCrossSectionData | List of data for the rectangular cross sections of the RoutingSegments.
circularCrossSectionData | List of data for the circular cross sections of the RoutingSegments.
requiredId | The guid to be set for the RoutingElement - optional parameter
Returns
If executed with success, returns the newly placed RoutingElement's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateRoutingElementDefault [1/2]
 MEPAPI_EXPORT Result< RoutingElementDefault > CreateRoutingElementDefault  |  ( |  const ACAPI::ElementDefault & |  defaultElem | )
friend
Creates a RoutingElementDefault from the given base element default.
Parameters
defaultElem | The base element default which will be converted to a RoutingElementDefault.
Since
Archicad 29
Returns
If the given base element default refers to a RoutingElement, returns a copy of the RoutingElementDefault, otherwise Error.
◆ CreateRoutingElementDefault [2/2]
 Result< RoutingElementDefault > CreateRoutingElementDefault  |  ( |  Domain |  domain | )
friend
Creates a RoutingElementDefault.
Parameters
domain | The Domain of the requested RoutingElementDefault.
Returns
If able, returns a copy of Archicad's current Default of the RoutingElement tool for the domain defined by the parameter, otherwise Error.